<a href="https://colab.research.google.com/github/kagglematsuo/Rapid_Challenge_Report/blob/master/skl_logistic_regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
#from モジュール名 import クラス名（もしくは関数名や変数名）
import pandas as pd
from pandas import DataFrame
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

#matplotlibをinlineで表示するためのおまじない (plt.show()しなくていい)
%matplotlib inline

In [134]:
# titanic data csvファイルの読み込み
titanic_df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/study_ai_ml_google/data/titanic_train.csv')

In [135]:
titanic_df[titanic_df.isnull().any(1)]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[708 rows x 12 columns]

In [136]:
titanic_df['AgeFill'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())

In [137]:
titanic_df['Sex'] = titanic_df['Sex'].map({'female': 0, 'male': 1}).astype(int)

In [143]:
titanic_df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [145]:
titanic_df

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked    AgeFill
0           0       3    1  22.0      1      0   7.2500        S  22.000000
1           1       1    0  38.0      1      0  71.2833        C  38.000000
2           1       3    0  26.0      0      0   7.9250        S  26.000000
3           1       1    0  35.0      1      0  53.1000        S  35.000000
4           0       3    1  35.0      0      0   8.0500        S  35.000000
..        ...     ...  ...   ...    ...    ...      ...      ...        ...
886         0       2    1  27.0      0      0  13.0000        S  27.000000
887         1       1    0  19.0      0      0  30.0000        S  19.000000
888         0       3    0   NaN      1      2  23.4500        S  29.699118
889         1       1    1  26.0      0      0  30.0000        C  26.000000
890         0       3    1  32.0      0      0   7.7500        Q  32.000000

[891 rows x 9 columns]

In [146]:
#性別と年齢だけのリストを作成
data1 = titanic_df.loc[:, ["AgeFill","Sex"]].values
print(data1)

[[22.          1.        ]
 [38.          0.        ]
 [26.          0.        ]
 ...
 [29.69911765  0.        ]
 [26.          1.        ]
 [32.          1.        ]]

In [148]:
#生死フラグのみのリストを作成
label1 =  titanic_df.loc[:,["Survived"]].values

In [140]:
from sklearn.linear_model import LogisticRegression

In [141]:
model=LogisticRegression()

In [147]:
model.fit(data1, label1)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [149]:
model.predict([[30,1]])

array([0])

In [150]:
model.predict_proba([[30,1]])

array([[0.80668102, 0.19331898]])